### Attributing one description to a column

In [1]:
# making a test dataframe 
##%pip install pandas

import pandas as pd
import numpy as np

In [2]:
col1 = np.arange(1,101,1)
col2 = np.arange(2,201,2)

In [3]:
print(len(col1) == len(col2))

True

In [4]:
df1 = {'Ones':col1,'Twos': col2}

df3 = {'Threes' : np.arange(3,301,3)}

df4 = {'Fours': np.arange(4,401,4)}

In [5]:
df1 = pd.DataFrame(df1)
df3 = pd.DataFrame(df3)
df4 = pd.DataFrame(df4)

In [6]:
ll = [df1,df3,df4]

for i in range(len(ll)):
    print(ll[i].head(3))

   Ones  Twos
0     1     2
1     2     4
2     3     6
   Threes
0       3
1       6
2       9
   Fours
0      4
1      8
2     12

In [7]:
#a list of single values that will be repeated across columns

ports = ['auto', 'home', 'motorcycle']


for i in range(len(ports)):
    ll[i] = ll[i].assign(Portfolio = f'{ports[i]}')

In [8]:
for i in range(len(ll)):
    print(ll[i].head(3))

   Ones  Twos Portfolio
0     1     2      auto
1     2     4      auto
2     3     6      auto
   Threes Portfolio
0       3      home
1       6      home
2       9      home
   Fours   Portfolio
0      4  motorcycle
1      8  motorcycle
2     12  motorcycle

In [10]:
df1.head() # need to update the linked list

   Ones  Twos
0     1     2
1     2     4
2     3     6
3     4     8
4     5    10

In [11]:
#update the linked list

df1 = ll[0]  
df3  = ll[1]
df4 = ll[2]

In [12]:
df1.head() #test if updated

   Ones  Twos Portfolio
0     1     2      auto
1     2     4      auto
2     3     6      auto
3     4     8      auto
4     5    10      auto

In [13]:
for i in range(len(ll)):
    ll[i]= ll[i].rename(columns ={'Portfolio':'Portfolio'+ f'{ports[i]}'}, inplace = True)

In [14]:
df4.head()

   Fours Portfoliomotorcycle
0      4          motorcycle
1      8          motorcycle
2     12          motorcycle
3     16          motorcycle
4     20          motorcycle

In [17]:
ll[2].head() #need to update the linked list

AttributeError: 'NoneType' object has no attribute 'head'

In [19]:
ll[0] = df1
ll[1] = df3
ll[2] = df4

In [25]:
#df4.head()
ll[0].head()

   Ones  Twos Portfolioauto
0     1     2          auto
1     2     4          auto
2     3     6          auto
3     4     8          auto
4     5    10          auto

In [26]:
for i in range(len(ll)):
    print(ll[i].head(3))

   Ones  Twos Portfolioauto
0     1     2          auto
1     2     4          auto
2     3     6          auto
   Threes Portfoliohome
0       3          home
1       6          home
2       9          home
   Fours Portfoliomotorcycle
0      4          motorcycle
1      8          motorcycle
2     12          motorcycle

In [32]:
df_test = pd.concat(ll, axis = 1)

In [33]:
df_test.head()

   Ones  Twos Portfolioauto  Threes Portfoliohome  Fours Portfoliomotorcycle
0     1     2          auto       3          home      4          motorcycle
1     2     4          auto       6          home      8          motorcycle
2     3     6          auto       9          home     12          motorcycle
3     4     8          auto      12          home     16          motorcycle
4     5    10          auto      15          home     20          motorcycle